{
  "recipes": [
    {
      "id": 1,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/burger.png",
      "recipeName": "Triple Bacon Burger",
      "recipeAuthor": "Jorge Relato",
      "recipeIngredients": [
        "3 kg of ground meat (choose lean and tender meat);",
        "300 g of ground bacon;",
        "1 egg;",
        "3 tablespoons of wheat flour;",
        "3 tablespoons of homemade seasoning: made with garlic, salt, onion, pepper and green smell processed in a blender;",
        "30 ml of cold water."
      ],
      "recipeTime": "60 min",
      "recipePrep": [
        "Mix all ingredients very well and knead so that everything is well mixed;",
        "Make portions of 90 g to 100 g;",
        "Line a wet plastic on a countertop and shape the hamburgers using a hoop as a base;",
        "Do one at a time and remove the ring immediately afterwards;",
        "Line a metal baking sheet with plastic, place the hamburgers and interleave layers of meat and plastics (without squeezing);",
        "Make a maximum of 4 layers per shape and freeze;",
        "Remove from the freezer, fry or bake and you are done."
      ],
      "recipeInfo": "                                Preheat the plate, frying pan or grill for 10 minutes before taking the hamburgers. Add a little oil or butter and don't mash the burgers! Did you know that the recipe that precedes the hamburger appeared in the 13th century, in Europe? The idea of ​​grinding the meat arrived in Hamburg in the 17th century, where a butcher also decided to season it. Thus, the recipe was disseminated in the United States by Germans in the region. There the idea arose to place the hamburger in the middle of the bread and add other ingredients, such as cheese, tomatoes and lettuce.\r\n                \r\n                "
    },
    {
      "id": 2,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/pizza.png",
      "recipeName": "4 Seasons Pizza",
      "recipeAuthor": "Fabiana Melo",
      "recipeIngredients": [
        "1 cup (tea) of milk;",
        "1 egg;",
        "1 teaspoon of salt;",
        "1 teaspoon of sugar;",
        "1 tablespoon of margarine;",
        "1 and 1/2 cup (tea) of wheat flour;",
        "1 spoon (dessert) of baking powder;",
        "1/2 can of tomato sauce;",
        "250 g of coarsely grated mozzarella;",
        "2 sliced ​​tomatoes;",
        "chopped olives;",
        "oregano to taste."
      ],
      "recipeTime": "45 min",
      "recipePrep": [
        "In a blender, beat together milk, egg, salt, sugar, margarine, wheat flour and baking powder until everything is incorporated;",
        "Pour the dough into a pizza pan greased with margarine and bake in the preheated oven for 20 minutes;",
        "Remove from the oven and pour the tomato sauce;",
        "Cover the pasta with grated mozzarella, tomato and oregano to taste;",
        "Take it back to the oven until the mozzarella melts."
      ],
      "recipeInfo": "Blender pizza is a delicious and super simple recipe to prepare. Made entirely in a blender, it is very practical for everyday use. Here at TudoGostoso you can also find several practical delicacies made in a blender: pancake batter, blender chicken pie, blender cheese bread, banana cake, chocolate cake and much more!"
    },
    {
      "id": 5,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/lasanha.png",
      "recipeName": "Mac n 'cheese Lasagna",
      "recipeAuthor": "Juliano Vieira",
      "recipeIngredients": [
        "Ready lasagna dough;",
        "400 g of ham;",
        "400 g of grated mozzarella;",
        "2 glasses of curd;",
        "150 g of mozzarella for gratin."
      ],
      "recipeTime": "50 min",
      "recipePrep": [
        "In a pan, put the butter to melt;",
        "Add the wheat flour and mix well with the help of a fouet;",
        "Add the milk and mix until it forms a homogeneous cream;",
        "Season with salt, pepper and nutmeg to taste;",
        "Turn off the heat and add the cream; mix well and set aside;"
      ],
      "recipeInfo": "Fill the lasagna with whatever you prefer."
    },
    {
      "id": 6,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/macarrao.png",
      "recipeName": "Garlic Spaghetti",
      "recipeAuthor": "Júlia Kinoto",
      "recipeIngredients": [
        "1 packet of pasta 500 g (type of pasta to taste);",
        "1 bag of granulated garlic;",
        "1/2 butter tablet (do not use margarine);",
        "1 tablespoon of extra virgin olive oil;",
        "herbs (basil, oregano, parsley, chives, thyme, to taste);",
        "salt;",
        "1 clove of garlic;",
        "powdered ginger to taste;",
        "1 bay leaf."
      ],
      "recipeTime": "20 min",
      "recipePrep": [
        "When there is about 5 minutes left before you are ready to drain the pasta, start preparing the recipe;",
        "Put the butter, oil, bay leaf, and granulated garlic in the hot skillet;",
        "At this time a little agility, because the drained pasta goes to the frying pan, being stirred and dosed with salt to taste, the herbs, the powdered ginger to taste as well;",
        "The garlic clove is used to grease the dishes where the pasta will be served;",
        "Put the portions on the dishes already smelling of garlic, and garnish with some herbs."
      ],
      "recipeInfo": "Do not wash the pasta or oil or grease it after draining it. Place directly in the frying pan."
    },
    {
      "id": 7,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/doce.png",
      "recipeName": "Pão-do-céu Sweets",
      "recipeAuthor": "Ricardo Golvea",
      "recipeIngredients": [
        "1 kg sweet-potato;",
        "100 g butter;",
        "3 eggs;",
        "1 packet of grated dry coconut (100 g);",
        "3 tablespoons of sugar 1 can of Leite Moça;",
        "1 tablespoon of baking powder;",
        "butter to grease;",
        "icing sugar;"
      ],
      "recipeTime": "50 min",
      "recipePrep": [
        "Cook the sweet potato in a pressure cooker, with half a liter of water, for about 20 minutes. Peel and pass through the juicer, still hot;",
        "Add the butter, eggs, desiccated coconut, sugar, Leite Moça and baking powder, stirring well after each addition;",
        "Pour into a greased, medium rectangular baking dish and place in a medium oven (180 ° C) for approximately 45 minutes. After cold, sprinkle with icing sugar and cut into squares."
      ],
      "recipeInfo": "No extra info."
    },
    {
      "id": 8,
      "recipeImg": "https://rocketseat-cdn.s3-sa-east-1.amazonaws.com/launchbase/receitas/asinha.png",
      "recipeName": "BBQ Chicken Wings",
      "recipeAuthor": "Vania Steroski",
      "recipeIngredients": [
        "12 chicken wings, seasoned to taste;",
        "2 tablespoons of wheat flour;",
        "1/2 cup (tea) of oil;",
        "1 cup of barbecue sauce."
      ],
      "recipeTime": "45 min",
      "recipePrep": [
        "In a bowl place the chicken wings and sprinkle the flour and mix with your hands;",
        "In a frying pan or roaster place the oil when it is hot fry until golden brown;",
        "To serve it looks nice with salad, or abuse your creativity."
      ],
      "recipeInfo": "No extra info."
    }
  ]
}